Catalogs/ОтделенияИпотечныхБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ОтделенияИпотечныхБанков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Банки</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>full_address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>E_mail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОтделенияИпотечныхБанков/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	////Сделано ТОЛЬКО для удобства ввода информацией пользователем, поэтому заполняем "чем попало"
	//СтруктураЗаписи = Новый Структура;
	//СтруктураЗаписи.Вставить("Объект"       , ПараметрыСеанса.ТекущийПользователь);
	//СтруктураЗаписи.Вставить("Тип"          , ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	//СтруктураЗаписи.Вставить("Вид"          , ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента"));
	//СтруктураЗаписи.Вставить("Представление", Объект.Адрес);
	//СтруктураЗаписи.Вставить("Комментарий"  , "");
	//
	//Для а = 1 По 10 Цикл
	//	СтруктураЗаписи.Вставить("Поле" + Строка(а), "");
	//КонецЦикла;
	//
	//ОбработкаРедактированияКИ = Обработки.РедактированиеКонтактнойИнформации.Создать();
	//ОбработкаРедактированияКИ.мВозвратСтруктуры = Истина;
	//
	//Если ТипЗнч(СтруктураЗаписи) = Тип("Структура") Тогда
	//	Для каждого ЭлементСтруктуры Из СтруктураЗаписи Цикл
	//		ОбработкаРедактированияКИ[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
	//	КонецЦикла; 
	//КонецЕсли;
	//
	//ФормаДляОткрытия = ОбработкаРедактированияКИ.ПолучитьФорму("ФормаЗаписиАдреса", Элемент);
	//ФормаДляОткрытия.Открыть();
	
	//ВыполнитьВызовНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВызовНаСервере()	
	
	//СтруктураЗаписи = Новый Структура;
	//СтруктураЗаписи.Вставить("Объект"       , Объект);
	//СтруктураЗаписи.Вставить("Тип"          , ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес");
	//СтруктураЗаписи.Вставить("Вид"          , ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента");
	//СтруктураЗаписи.Вставить("Представление", Объект.Адрес);
	//СтруктураЗаписи.Вставить("Комментарий"  , "");
	//
	//Для а = 1 По 10 Цикл
	//	СтруктураЗаписи.Вставить("Поле" + Строка(а), "");
	//КонецЦикла;
	//
	//Обработки.РедактированиеКонтактнойИнформации.Создать().РедактироватьЗапись(МенеджерЗаписи, Ложь);	
	
	//Отладка = УправлениеКонтактнойИнформациейНаСервере.ПолучитьСтруктуруАдресаИзСтроки(Адрес);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Сообщить("Запрещено создавать документы копированием.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Элементы.ГруппаОнлайн.Доступность = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ПараметрыПодключения"));
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораОтделенийИпотечныхБанков()
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		ПараметрыПодключенияAPI = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ПараметрыПодключения");
		Отделения = ЗаявкиНаКредитRestAPI.ПолучитьОтделенияБанков(ПараметрыПодключенияAPI); //Неопределено;//  !!!
		Если НЕ Отделения = Неопределено Тогда
			Для каждого Отделение Из Отделения Цикл
				ОтделенияБанкаОнлайн.Добавить(Отделение.ID, Отделение.Name + " (адрес: " + Отделение.full_address + ")");
				ЗаполнитьЗначенияСвойств(ТЗ_ОтделенияБанка.Добавить(), Отделение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымБанка(ID)
	
	НайденныеСтроки = ТЗ_ОтделенияБанка.НайтиСтроки(Новый Структура("ID", ID));
	Если НайденныеСтроки.Количество() Тогда
		Объект.ID = НайденныеСтроки[0].ID;
		Объект.name = НайденныеСтроки[0].name;
		Объект.full_address = НайденныеСтроки[0].full_address;
		//Объект.Наименование = Объект.name;
		//Объект.Адрес = Объект.full_address;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаполнитьСписокВыбораОтделенийИпотечныхБанков();
	Если ОтделенияБанкаОнлайн.Количество() Тогда
		ВыбранноеОтделение = ОтделенияБанкаОнлайн.ВыбратьЭлемент("Выберите отделение банка");
		Если НЕ ВыбранноеОтделение = Неопределено Тогда
			ЗаполнитьПоДаннымБанка(ВыбранноеОтделение.Значение);	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура АдресОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//ПредставлениеАдреса = "";	
	//Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
	//		И ВыбранноеЗначение.Свойство("Представление", ПредставлениеАдреса) Тогда
	//		
	//	СтандартнаяОбработка 	= Ложь;			
	//	Адрес 					= ПредставлениеАдреса;
	//	
	//КонецЕсли;

КонецПроцедуры
